app/controllers/home_controller.rb

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."is_private" = ? LIMIT ?  [["is_private", 0], ["LIMIT", 5]]
---
  def index
  	@tournaments = Tournament.where(:is_private => '0').limit(5)